Revit 2022 API
Connector.VelocityPressure Property
The velocity pressure of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public double VelocityPressure { get; }
Visual Basic
Public ReadOnly Property VelocityPressure As Double
	Get
Visual C++
public:
property double VelocityPressure {
	double get ();
}
Remarks
Instantaneous velocity pressure of this connector,calculated according to system.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the connector's domain is not DomainHvac or DomainPiping.
See Also
Connector Class
Autodesk.Revit.DB Namespace